# CharactersNotAllowed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeneralFailures..::..CharactersNotAllowed Property
BuiltInFailures..::..GeneralFailures Class See Also
---
Name cannot contain any of the following characters:\n[{}[]|;<>?`~]\nor any of the non-printable characters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CharactersNotAllowed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CharactersNotAllowed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CharactersNotAllowed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeneralFailures Class
Autodesk.Revit.DB Namespace